#OpenCV استيراد مكتبة 
import cv2

#image وتخزينها في متغير  img.jpg قراءة الصورة من ملف
#لو طبعناه بيطبع لي ابعاد الصورة بمصفوفة
image = cv2.imread("img2.jpg")

# "Fatimah" عرض الصورة على الشاشة واسم النافذة بيكون 
cv2.imshow('Fatimah' , image)

#F انتظار الضغط على أي مفتاح على لوحة المفاتيح وتخزين القيمة المرتبطة به في المتغير 
#عشان تبقا الصورة وما تتقفل على طول
F = cv2.waitKey(0)

# في لوحة المفاتيح او 27 s إذا تم الضغط على مفتاح الـ 
if F == 27 or F == ord('s'):
#فإن جميع النوافذ المفتوحة في البرنامج ستتم إغلاقها
    cv2.destroyAllWindows()